#include <stdio.h>
#include <iostream>
#include <algorithm>
const int N=14;

//void Sum_Rows(int a[][N],int n,int m,int S[])
void Sum_Rows(int a[][N],int n,int m,int S[])
{
int i,j;
for(i=0;i<n;i++)
{
S[i]=0;
for(j=0;j<m;j++)
S[i]=S[i]+a[i][j];
}
}

int main(void)
{
int a[N][N] = { 
		{243,523,23,4,24,5555,-4444,2,234,32,23,253,656,3533},
		{243,23,253,4,24,55555,-444,2,234,32,23,253,66,333},
		{2543,23,23,4,24,5555,-144,2,234,352,23,23,66,333},
		{243,23,23,4,24,55455,-4,2,234,32,23,243,66,333},
		{243,423,23,4,24,5555,-44,2,234,342,23,23,66,333},
		{243,23,23,4,24,555,-44,2,234,32,23,23,66,333},
		{2543,23,23,4,24,5555,-4444,2,234,342,23,233,66,333},
		{243,23,23,4,24,5555,-4444,2,234,32,23,23,66,333},
		{243,423,23,24,24,5555,-44,2,234,32,23,23,66,333},
		{2543,23,23,4,24,555,-42,2,234,352,523,23,66,333},
		{243,23,323,4,24,5555,-344,2,234,32,23,23,66,3353},
		{2543,23,23,4,24,555,-454,2,234,32,523,23,66,333},
		{243,23,23,4,24,5555,-44,2,234,32,23,253,66,333},
		{2543,23,23,4,24,55255,-444,2,234,32,523,23,66,333} 
		}; 
int m=14, n=14;

//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d\t",a[i][j]);
}
printf("\n");
}
printf("======\n");


//Если переменить эти циклы местами, просмотр будет происходить по столбцам:
for(int j=0;j<m;j++){
for(int i=0;i<n; i++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d ",a[i][j]);
}
printf("\n");
}
{
// в теле цикла обращение к переменной a[i][j]
}


printf("=======\n");
int S[N]={243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333};
Sum_Rows(a,n,m,S);

for(int j=0;j<m;j++){
// в теле цикла обращение к переменной a[i][j]
printf("%d ",S[j]);
}
printf("\n");

printf("======\n");

}
