#include <stdio.h>
#include <iostream>
#include <algorithm>
const int N=14;

int Maxx(int a[][N],int n,int m, int &Maxi, int &Maxj)
{
int Max=a[0][0];
int i,j;
Maxi=Maxj=0;
for(i=0;i<n;i++)
for(j=0;j<m;j++)
if(a[i][j]>Max)
{
Max=a[i][j];
Maxi=i;
Maxj=j;
}
return Max;
}

int main(void)
{
int a[14][14] = { 
		{2432,23,23,4,24,5555,-444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44344,2,234,32,23,223,66,33},
		{2243,23,223,4,24,5555,-444,2,234,32,23,23,626,323},
		{243,23,23,4,24,5555,-44444,2,234,32,223,23,66,3},
		{243,323,23,4,24,5555,-44444,2,234,32,223,23,66,333},
		{243,23,223,4,24,5555,-4444,2,234,32,223,23,66,33},
		{2243,23,2223,4,24,5555,-44444,2,234,32,223,23,66,333},
		{24323,223,23,4,24,5555,-44444,2,234,32,223,23,66,323},
		{243,23,233,4,24,5555,-4444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-4344,2,234,322,23,23,66,333},
		{2423,233,23,24,24,5555,-44444,22,2234,32,23,23,66,233},
		{243,23,23,4,24,5555,-444,2,234,32,23,23,66,333},
		{2243,23,223,24,24,5555,-4424,22,234,32,23,23,66,23},
		{243,23,23,4,24,5555,-4244,22,234,32,23,23,66,133} 
		}; 
int m=14, n=14;

//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d\t",a[i][j]);
}
printf("\n");
}
printf("======\n");


//Если переменить эти циклы местами, просмотр будет происходить по столбцам:
for(int j=0;j<m;j++){
for(int i=0;i<n; i++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d ",a[i][j]);
}
printf("\n");
}
{
// в теле цикла обращение к переменной a[i][j]
}
printf("=======\n");

int Maxi, Maxj;
printf("\n %d %d %d \n" , Maxx(a, n, m, Maxi, Maxj) , Maxi, Maxj);

printf("\n======\n");

}
