#include <stdio.h>
#include <iostream>
#include <algorithm>

const int N=14;

int Insert_Row(int a[][N],int &n,int m,int k)
{
int i,j;
if(k>m)
return 0; // если неверно задано значение k
for(i=n-1;i>=k;i--) // раздвигаем строки
for(j=0;j<m;j++)
a[i+1][j]=a[i][j];
//n++;
// заполняем нулями освободившуюся строку
for(j=0;j<m;j++)
a[k][j]=0;
return 1;
}

int main(void)
{
int a[14][14] = { 
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333} 
		}; 
int m=14, n=14;

//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d\t",a[i][j]);
}
printf("\n");
}
printf("======\n");

//Если переменить эти циклы местами, просмотр будет происходить по столбцам:
for(int j=0;j<m;j++){
for(int i=0;i<n; i++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d ",a[i][j]);
}
printf("\n");
}
{
// в теле цикла обращение к переменной a[i][j]
}

printf("=======\n");

int k=5;
int aa = Insert_Row( a, n, m, k );
printf("\n %d \n" ,aa);

int kk=11;
int aaa = Insert_Row( a, n, m, kk );
printf("\n %d \n" ,aaa);


//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
// в теле цикла обращение к переменной a[i][j]
printf("%d\t",a[i][j]);
}
printf("\n");
}
printf("======\n");

return 0; 
}
