#include <stdio.h>
#include <iostream>
#include <algorithm>
const int N=14;

int Cou_Rows(int a[][N],int n,int m)
{
int i,j;
int k=0;
int flag;
for(i=0;i<n;i++)
{
j=0;
flag=0;
while(j<m && flag==0)
{
if(a[i][j]==0)
{
flag=1;
k++;
}
else j++;
}
}
return k;
}

int main(void)
{
int a[14][14] = { 
		{1,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{2,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{3,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{443,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{65243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{7243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{8243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{9243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{10243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{11243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{12243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{13243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{142143,23,23,4,24,5555,-44444,2,234,32,23,23,66,333},
		{15243,23,23,4,24,5555,-44444,2,234,32,23,23,66,333} 
		}; 
int m=14, n=14;

//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
	// в теле цикла обращение к переменной a[i][j]
	printf("%d\t",a[i][j]);
}
	printf("\n");
}
	printf("======\n");

//Если переменить эти циклы местами, просмотр будет происходить по столбцам:
for(int j=0;j<m;j++){
for(int i=0;i<n; i++)
{
	// в теле цикла обращение к переменной a[i][j]
	printf("%d ",a[i][j]);
}
	printf("\n");
}
{
	// в теле цикла обращение к переменной a[i][j]
}

printf("=======\n");

int k=5;

int aa = Cou_Rows(a,n,m);
printf("\n %d" ,aa);


	printf("=======\n");

	//Для обращения к элементам матрицы по строкам цикл записывается так:
for(int i=0;i<n;i++) {
for(int j=0;j<m;j++)
{
	// в теле цикла обращение к переменной a[i][j]
	printf("%d\t",a[i][j]);
}
	printf("\n");
}
	printf("======\n");

}
