#include <stdio.h>
// библиотека стандартного ввода-вывода
#include <math.h>
// библиотека математических функций

float Avg(float a, float b, float c)
{
float S; // локальная переменная
S=(a+b+c)/3.;
return S; // тип совпадает с типом функции
}

/*
float Avg(float a, float b, float c)
{
return (a+b+c)/3.; // тип совпадает с типом функции
}
*/

int main(void)
{
    
printf("\n=======\n");

// фактические параметры – переменные.
// результат присвоен y
float x1=2.5, x2=7., x3=3.5;
float y=Avg(x1,x2,x3);
printf("x1=%f, x2=%f, x3=%f, y= %f\n",x1,x2,x3,y);

// фактические параметры – константы. Результат присвоен y
y=Avg(2., 4., 7.);
printf("x1=%f, x2=%f, x3=%f y= %f\n" ,2.,4.,7.,y);

// фактические параметры – выражения
// результат выводится на печать
printf("x1=%f, x2=%f, x3=%f, y= %f\n",x1,x2,x3,y);

printf("\n=======\n");

return 0;

}
		
