#include <stdio.h>
// библиотека стандартного ввода-вывода
#include <math.h>
// библиотека математических функций

#define N 10 // объявление длины массива

#define M 7

int function(int a[][m], int n, int m);
// здесь m – константное выражение

int main(void)
{

printf("\n=======\n");

{
int a[N][M];
}

int a[N][M]; 	// максимальное число строк, столбцов
int n, m; 	// реальное число строк, столбцов
printf("Введите размер матрицы (строк, столбцов <25)\n");
scanf("%d%d", &n, &m); // теперь это наибольшие значения
		// параметров цикла

for(i=0; i<n; i++)
for(j=0; j<m; j++)
{
// в теле цикла обращение к переменной a[i][j]
}

for(j=0; j<m; j++)
for(i=0; i<n; i++)
{
// в теле цикла обращение к переменной a[i][j]
}

{
int a[25]; // матрица размером 5×5
int n, m;
n=5;
m=5;
}


for(i=0; i<n; i++)
for(j=0; j<m; j++)
{
//В теле цикла обращение к переменной *(a+i*m+j)
}


printf("\n=======\n");

return 0;
}	
